/*--------------www.szjcdz.cn--------------------
  名称：定时器0
  编写：szjcdz
  日期：2010.9
  内容：通过定时让LED灯闪烁
------------------------------------------------*/
#include<8052.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义
#include <chaos.h> 

/*sbit LED=P1^2;    //定义LED端口*/
#define LED P1_2
#define LED3 P1_3 

extern volatile unsigned char light = 0; 



/*------------------------------------------------
                    定时器初始化子程序
------------------------------------------------*/
void Init_Timer0(void)
{
 TMOD |= 0x01;	  //使用模式1，16位定时器，使用"|"符号可以在使用多个定时器时不受影响		     
 TH0=0xff;	      //给定初值，这里使用定时器最大值从0开始计数一直到65535溢出
 TL0=0x00;
 EA=1;            //总中断打开
 ET0=1;           //定时器中断打开
 TR0=1;           //定时器开关打开
 /*LED = 0; */
 P1_2 = 0; 
 P1_1 = 0; 
 LED3 = 0; 
 P1_4 = 0; 
}

void shine(void) {
  light = 1 - light; 
  P1_2 = light; 
}

/*------------------------------------------------
                    主程序
------------------------------------------------*/
main()
{
 Init_Timer0();
 while(1) {
  /*P1_1 = 0;  */
  /*delay_s(1); */
  /*P1_1 = 1; */
  /*delay_s(1); */
   P1_1 = 1 - P1_1; 
   /*delay_s(1); */
   LED3 = 1 - LED3; 
   P1_4 = light; 
   delay_s(1); 
 }
}

/*------------------------------------------------
                 定时器中断子程序
------------------------------------------------*/
/*void Timer0_isr(void) __interrupt (1) __using (1)*/
void Timer0_isr(void) __interrupt (1)
{
 /*light = 1 - light; */
  /*light = ~light; */
 /*P1_2 = 1 - P1_2; */
 /*delay_ms(1); */
 TR0 = 0; 
 /*TF0 = 0; */
 TH0=0xff;		  //重新赋值
 TL0=0x00;
 TR0 = 1; 

 /*LED=~LED;        //指示灯反相，可以看到闪烁*/
 /*P1_2 = ~P1_2; */
 /*P1_2 = P1_1; */
 /*shine(); */
 /*light = P1_2; */
 /*P1_2 = light; */
 shine(); 
 /*P1_2 = 1 - P1_2; */
 /*P1_2 = P1_1; */

 LED3 = 1 - LED3; 
}
